


a=[
["金融、应用统计、税务、国际商务、保险、资产评估","A类",343,48,72]
,["金融、应用统计、税务、国际商务、保险、资产评估","A类",333,45,68]
,["审计","A类",175,44,88]
,["审计","B类",165,39,78]
,["法律(非法学)、法律(法学)、社会工作、警务","A类",325,46,69]
,["法律(非法学)、法律(法学)、社会工作、警务","B类",315,43,65]
,["教育、汉语国际教育","A类",331,46,69]
,["教育、汉语国际教育","B类",321,43,65]
,["应用心理","A类",331,46,138]
,["应用心理","B类",321,43,129]
,["体育","A类",277,35,105]
,["体育","B类",267,32,96]
,["翻译、新闻与传播、出版","A类",355,52,78]
,["翻译、新闻与传播、出版","B类",345,49,74]
,["文物与博物馆","A类",324,44,132]
,["文物与博物馆","B类",314,41,123]
,["建筑学、城市规划、电子信息、机械、材料与化工、资源与环境、能源动力、土木水利、生物与医药、交通运输","A类",264,37,56]
,["建筑学、城市规划、电子信息、机械、材料与化工、资源与环境、能源动力、土木水利、生物与医药、交通运输","B类",254,34,51]
,["农业、兽医、风景园林、林业","A类",253,33,50]
,["农业、兽医、风景园林、林业","B类",243,30,45]
,["临床医学、口腔医学、公共卫生、护理、药学、中药学","A类",300,42,126]
,["临床医学、口腔医学、公共卫生、护理、药学、中药学","B类",290,39,117]
,["中医","A类",300,41,123]
,["中医","B类",290,38,114]
,["军事","A类",265,37,56]
,["军事","B类",255,34,51]
,["工商管理、公共管理、会计、旅游管理、图书情报、工程管理","A类",175,44,88]
,["工商管理、公共管理、会计、旅游管理、图书情报、工程管理","B类",165,39,78]
,["艺术","A类",347,38,57]
,["艺术","B类",337,35,53]
,["享受少数民族政策的考生","A类",248,30,45]
,["享受少数民族政策的考生","B类",248,30,45]
]


import csv

headers = ['subject','region','grade_class','year','grade','degree_type']

rows = []
for i in a:
    year = 2020
    for j in range(2, i.__len__(),3):
        if(i[j]):
            rows.append([i[0],i[1],'总分',year,i[j],'专硕'])
            rows.append([i[0],i[1],'单科=100分',year,i[j+1],'专硕'])
            rows.append([i[0],i[1],'单科>100分',year,i[j+2],'专硕'])
        year+=1

print(rows)
with open('test.csv','w',newline='')as f:
    f_csv = csv.writer(f)
    f_csv.writerow(headers)
    f_csv.writerows(rows)
